@xiaxyi I totally understand why it was defaulted that way, and yes setting `premium_messaging_partitions = 1` stops terraform from replacing it. However, setting  `premium_messaging_partitions = 1` as default will break Basic and Standard skus

the plan will look like:
```terraform
# azurerm_servicebus_namespace.basic must be replaced
-/+ resource "azurerm_servicebus_namespace" "basic" {
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://basic-skilled-anteater.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/.../resourceGroups/staging/providers/Microsoft.ServiceBus/namespaces/basic-skilled-anteater" -> (known after apply)
      ~ minimum_tls_version                 = "1.2" -> (known after apply)
        name                                = "basic-skilled-anteater"
      ~ premium_messaging_partitions        = 0 -> 1 # forces replacement
      - tags                                = {} -> null
      - zone_redundant                      = false -> null
        # (6 unchanged attributes hidden)

      - network_rule_set {
          - default_action                = "Allow" -> null
          - ip_rules                      = [] -> null
          - public_network_access_enabled = true -> null
          - trusted_services_allowed      = false -> null
        }
    }

  # azurerm_servicebus_namespace.standard must be replaced
-/+ resource "azurerm_servicebus_namespace" "standard" {
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://standard-skilled-anteater.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/.../resourceGroups/staging/providers/Microsoft.ServiceBus/namespaces/standard-skilled-anteater" -> (known after apply)
      ~ minimum_tls_version                 = "1.2" -> (known after apply)
        name                                = "standard-skilled-anteater"
      ~ premium_messaging_partitions        = 0 -> 1 # forces replacement
      - tags                                = {} -> null
      - zone_redundant                      = false -> null
        # (6 unchanged attributes hidden)

      - network_rule_set {
          - default_action                = "Allow" -> null
          - ip_rules                      = [] -> null
          - public_network_access_enabled = true -> null
          - trusted_services_allowed      = false -> null
        }
    }
```

and the error looks like:
```terraform
│ Error: Premium messaging partition is not supported by service Bus SKU "Standard" and it can only be set to 0
│
│   with azurerm_servicebus_namespace.standard,
│   on main.tf line 1, in resource "azurerm_servicebus_namespace" "standard":
│    1: resource "azurerm_servicebus_namespace" "standard" {
│
╵
╷
│ Error: Premium messaging partition is not supported by service Bus SKU "Basic" and it can only be set to 0
│
│   with azurerm_servicebus_namespace.basic,
│   on main.tf line 9, in resource "azurerm_servicebus_namespace" "basic":
│    9: resource "azurerm_servicebus_namespace" "basic" {
│
```

I'm just wondering if there's a way to make it to where upgrading won't break any existing skus. I imagine the most common use case will be to not have `premium_messaging_partitions` defined at all. 